let a = 1;
let b = 5;
let str = "6"

//Унарный плюс +
console.log(`Унарный плюс + (+a(1)): ${+a}`);
//Унарный минус -
console.log(`Унарный минус - (-b(5)): ${-b}`);
//Сложение чисел, бинарный плюс +
console.log(`Сложение строк, бинарный плюс + (a(1) + b(5)): ${a + b}`);
//Вычитание чисел, бинарный минус -
console.log(`Вычитание чисел, бинарный минус - (a(1) - b(5)): ${a - b}`);
//Остаток от деления %
console.log(`Остаток от деления % (b(5) % a(1)): ${b % a}`);
//Инкремент ++ после
console.log(`Инкремент ++ после a(1): ${a++}`);
//Декремент -- после
console.log(`Декремент -- после b(5): ${b--}`);
//Инкремент ++ до
a = 1;
console.log(`Инкремент ++ до a(1): ${++a}`);
//Декремент -- до
b = 5;
console.log(`Декремент -- до b(5): ${--b}`);
//Присваивание
a = 1, b = 5;
console.log(`Присваивание = (a = b(5)): ${a = b}`);
a = 1, b = 5;
console.log(`Присваивание = (b = a(1)): ${b = a}`);
//Сложение строк, бинарный +
console.log(`Сложение строк, бинарный плюс + (str("6") + str("6")): ${str + str}`);
//Преобразование к числу, унарный плюс +
console.log(`Преобразование к числу, унарный плюс + (+str("6")): ${+str}`);
//Сокращённая арифметика с присваиванием
console.log("Сокращённая арифметика с присваиванием:")
a = 1, b = 5;
console.log(`+= (a(1) += 3): ${a += 3}`);
console.log(`*= (b(5) += 2): ${b *= 2}`);
a = 1, b = 5;
console.log(`-= (a(1) -= 3): ${a -= 3}`);
console.log(`/= (b(5) /= 2): ${b /= 2}`);
//Операторы сравнения
console.log("Операторы сравнения:");
a = 1, b = 5;
console.log(`== (a(1) == b(5)): ${a == b}`);
console.log(`!= (a(1) != b(5)): ${a != b}`);
console.log(`<= (a(1) <= b(5)): ${a <= b}`);
console.log(`>= (a(1) >= b(5)): ${a >= b}`);
console.log(`=== (a(1) === b(5)): ${a === b}`);
console.log(`> (a(1) > b(5)): ${a > b}`);
console.log(`< (a(1) < b(5)): ${a < b}`);